title: Detección de usuario agregado a Domain Admins
id: 00000000-0000-0000-0000-000000000000
level: High
author: Jair
date: 2025-06-13
description: |
  Detecta cuando un usuario es agregado al grupo "Domain Admins" en Active Directory, lo que puede indicar una posible escalada de privilegios o actividad sospechosa.
tags:
  - attack.persistence #La adición de usuarios a grupos privilegiados puede ser utilizada por atacantes para mantener acceso persistente en el sistema
  - attack.privilege_escalation #Un usuario agregado a Domain Admins obtiene privilegios elevados, lo que puede indicar una escalada de privilegios
  - attack.t1098 #Representa la manipulación de cuentas y grupos en Active Directory para obtener acceso privilegiado
  - attack.t1078 #Se refiere al uso de cuentas legítimas para obtener acceso administrativo

status: Experimental
logsource:
  category: security
  product: windows
detection:
  selection:
    EventID: 4728
    GroupName: "Domain Admins"
  exception_1:
    SubjectUserName:
      - "Administrator"
      - "admin"
  condition: selection and not 1 of exception_*
falsepositives:
  - Administración legítima de usuarios en Active Directory
level: High
